In [4]:
import numpy as np 
import pandas as pd

JOINING

In [8]:
df1= pd.DataFrame({'key': ['a','b','c','d','e'],
                   'A1': range(5),
                   'B1': range(5,10)
})
df2= pd.DataFrame({'key': ['a','b','c'],
                   'A2': range(3),
                   'B2': range(3,6)
})

In [10]:
df1

  key  A1  B1
0   a   0   5
1   b   1   6
2   c   2   7
3   d   3   8
4   e   4   9

In [12]:
df2

  key  A2  B2
0   a   0   3
1   b   1   4
2   c   2   5

In [12]:
df2

  key  A2  B2
0   a   0   3
1   b   1   4
2   c   2   5

In [16]:
#merge dataframe
pd.merge(df1,df2,how='inner',on='key')[['A1','A2']]  # pd.merge(dfname, dfname, how='',on='')

   A1  A2
0   0   0
1   1   1
2   2   2

1. Find null:

   df.isnull().sum()----->> will show column wise null value.
   ii. .sum().sum()------>> will show total null value in a data set

2. Row wise  find null:

    df.loc[1].isnull.sum() 

3. notnull() is opossite of isnull().

4. Sum of a column:

   df['A'].sum()/.mean----> TO DO SAME for rows use .loc

5. dropna(axis=?)/fillna(value=?)/fillna(method=?{'ffill'/'bfill'})

6. df.loc['index','column'] = new value